{"format": "graph-model", "generatedBy": "1.15.0", "convertedBy": "TensorFlow.js Converter v1.7.2", "userDefinedMetadata": {"signature": {"inputs": {"input/Ob:0": {"name": "input/Ob:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}, {"size": "5"}, {"size": "5"}]}}}, "outputs": {"output/Softmax:0": {"name": "output/Softmax:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "125"}]}}}}}, "modelTopology": {"node": [{"name": "input/Ob", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "5"}, {"size": "5"}, {"size": "5"}]}}}}, {"name": "model/c8/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "5"}]}}}}}, {"name": "model/c7/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/c6/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/c7/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/c5/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/c4/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}}, {"name": "model/c3/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/c2/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/c1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}}}, {"name": "model/c1/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "5"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/c8/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/c2/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/c3/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/c4/w", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "model/c5/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/c6/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model/c1/Conv2D", "op": "Conv2D", "input": ["input/Ob", "model/c1/w"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "model/c1/add", "op": "AddV2", "input": ["model/c1/Conv2D", "model/c1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/Relu", "op": "Relu", "input": ["model/c1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/c2/Conv2D", "op": "Conv2D", "input": ["model/Relu", "model/c2/w"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "model/c2/add", "op": "AddV2", "input": ["model/c2/Conv2D", "model/c2/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/Relu_1", "op": "Relu", "input": ["model/c2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/c3/Conv2D", "op": "Conv2D", "input": ["model/Relu_1", "model/c3/w"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "model/c3/add", "op": "AddV2", "input": ["model/c3/Conv2D", "model/c3/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/Relu_2", "op": "Relu", "input": ["model/c3/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/c4/Conv2D", "op": "Conv2D", "input": ["model/Relu_2", "model/c4/w"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "model/c4/add", "op": "AddV2", "input": ["model/c4/Conv2D", "model/c4/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/Relu_3", "op": "Relu", "input": ["model/c4/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/c5/Conv2D", "op": "Conv2D", "input": ["model/Relu_3", "model/c5/w"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "model/c5/add", "op": "AddV2", "input": ["model/c5/Conv2D", "model/c5/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/Relu_4", "op": "Relu", "input": ["model/c5/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/c6/Conv2D", "op": "Conv2D", "input": ["model/Relu_4", "model/c6/w"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "model/c6/add", "op": "AddV2", "input": ["model/c6/Conv2D", "model/c6/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/Relu_5", "op": "Relu", "input": ["model/c6/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/c7/Conv2D", "op": "Conv2D", "input": ["model/Relu_5", "model/c7/w"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "model/c7/add", "op": "AddV2", "input": ["model/c7/Conv2D", "model/c7/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/Relu_6", "op": "Relu", "input": ["model/c7/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/c8/Conv2D", "op": "Conv2D", "input": ["model/Relu_6", "model/c8/w"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "model/c8/add", "op": "AddV2", "input": ["model/c8/Conv2D", "model/c8/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/Relu_7", "op": "Relu", "input": ["model/c8/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/Reshape", "op": "Reshape", "input": ["model/Relu_7", "model/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "output/Softmax", "op": "Softmax", "input": ["model/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 134}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "model/c8/Reshape", "shape": [1, 1, 1, 5], "dtype": "float32"}, {"name": "model/c7/Reshape", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "model/c6/Reshape", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "model/c7/w", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "model/c5/Reshape", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "model/c4/Reshape", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "model/c3/Reshape", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "model/c2/Reshape", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "model/c1/Reshape", "shape": [1, 1, 1, 32], "dtype": "float32"}, {"name": "model/c1/w", "shape": [3, 3, 5, 32], "dtype": "float32"}, {"name": "model/c8/w", "shape": [3, 3, 64, 5], "dtype": "float32"}, {"name": "model/c2/w", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "model/c3/w", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "model/c4/w", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "model/c5/w", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "model/c6/w", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "model/Reshape/shape", "shape": [2], "dtype": "int32"}]}]}