{"convertedBy": "TensorFlow.js Converter v1.6.0", "userDefinedMetadata": {"signature": {"outputs": {"output/Softmax:0": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}, "name": "output/Softmax:0"}}, "inputs": {"input/Ob:0": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}, {"size": "10"}, {"size": "5"}]}, "name": "input/Ob:0"}}}}, "generatedBy": "1.15.0", "modelTopology": {"node": [{"attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "10"}, {"size": "10"}, {"size": "5"}]}}}, "op": "Placeholder", "name": "input/Ob"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}, "op": "Const", "name": "model/c3/Reshape"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}, "op": "Const", "name": "model/c2/Reshape"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}}, "op": "Const", "name": "model/c1/Reshape"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "10"}, {"size": "5"}]}}}}, "op": "Const", "name": "input/sub/y"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "5"}, {"size": "32"}]}}}}, "op": "Const", "name": "model/c1/w"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "9"}]}}}}, "op": "Const", "name": "model/pi/w"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}, "op": "Const", "name": "model/c2/w"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}, "op": "Const", "name": "model/c3/w"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "op": "Const", "name": "model/Reshape/shape"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}}, "op": "Const", "name": "model/fc1/w"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}}, "op": "Const", "name": "model/pi/b"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "op": "Const", "name": "model/fc1/b"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "10"}, {"size": "5"}]}}}}, "op": "Const", "name": "ConstantFolding/input/truediv_recip"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "Sub", "input": ["input/Ob", "input/sub/y"], "name": "input/sub"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "Mul", "input": ["ConstantFolding/input/truediv_recip", "input/sub"], "name": "input/truediv"}, {"device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "op": "Conv2D", "input": ["input/truediv", "model/c1/w"], "name": "model/c1/Conv2D"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "AddV2", "input": ["model/c1/Conv2D", "model/c1/Reshape"], "name": "model/c1/add"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "Relu", "input": ["model/c1/add"], "name": "model/Relu"}, {"device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "op": "Conv2D", "input": ["model/Relu", "model/c2/w"], "name": "model/c2/Conv2D"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "AddV2", "input": ["model/c2/Conv2D", "model/c2/Reshape"], "name": "model/c2/add"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "Relu", "input": ["model/c2/add"], "name": "model/Relu_1"}, {"device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "op": "Conv2D", "input": ["model/Relu_1", "model/c3/w"], "name": "model/c3/Conv2D"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "AddV2", "input": ["model/c3/Conv2D", "model/c3/Reshape"], "name": "model/c3/add"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "Relu", "input": ["model/c3/add"], "name": "model/Relu_2"}, {"attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "op": "Reshape", "input": ["model/Relu_2", "model/Reshape/shape"], "name": "model/Reshape"}, {"device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}, "op": "MatMul", "input": ["model/Reshape", "model/fc1/w"], "name": "model/fc1/MatMul"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "AddV2", "input": ["model/fc1/MatMul", "model/fc1/b"], "name": "model/fc1/add"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "Relu", "input": ["model/fc1/add"], "name": "model/Relu_3"}, {"device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}, "op": "MatMul", "input": ["model/Relu_3", "model/pi/w"], "name": "model/pi/MatMul"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "AddV2", "input": ["model/pi/MatMul", "model/pi/b"], "name": "model/pi/add"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "Softmax", "input": ["model/pi/add"], "name": "output/Softmax"}], "versions": {"producer": 134}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"shape": [1, 1, 1, 64], "dtype": "float32", "name": "model/c3/Reshape"}, {"shape": [1, 1, 1, 64], "dtype": "float32", "name": "model/c2/Reshape"}, {"shape": [1, 1, 1, 32], "dtype": "float32", "name": "model/c1/Reshape"}, {"shape": [10, 10, 5], "dtype": "float32", "name": "input/sub/y"}, {"shape": [3, 3, 5, 32], "dtype": "float32", "name": "model/c1/w"}, {"shape": [512, 9], "dtype": "float32", "name": "model/pi/w"}, {"shape": [3, 3, 32, 64], "dtype": "float32", "name": "model/c2/w"}, {"shape": [3, 3, 64, 64], "dtype": "float32", "name": "model/c3/w"}, {"shape": [2], "dtype": "int32", "name": "model/Reshape/shape"}, {"shape": [1024, 512], "dtype": "float32", "name": "model/fc1/w"}, {"shape": [9], "dtype": "float32", "name": "model/pi/b"}, {"shape": [512], "dtype": "float32", "name": "model/fc1/b"}, {"shape": [10, 10, 5], "dtype": "float32", "name": "ConstantFolding/input/truediv_recip"}]}], "format": "graph-model"}