{"generatedBy": "1.15.0", "weightsManifest": [{"weights": [{"dtype": "float32", "name": "model/c3/Reshape", "shape": [1, 1, 1, 64]}, {"dtype": "float32", "name": "model/c2/Reshape", "shape": [1, 1, 1, 64]}, {"dtype": "float32", "name": "model/c1/Reshape", "shape": [1, 1, 1, 32]}, {"dtype": "float32", "name": "input/sub/y", "shape": [10, 10, 5]}, {"dtype": "float32", "name": "model/c1/w", "shape": [3, 3, 5, 32]}, {"dtype": "float32", "name": "model/pi/w", "shape": [512, 6]}, {"dtype": "float32", "name": "model/c2/w", "shape": [3, 3, 32, 64]}, {"dtype": "float32", "name": "model/c3/w", "shape": [3, 3, 64, 64]}, {"dtype": "int32", "name": "model/Reshape/shape", "shape": [2]}, {"dtype": "float32", "name": "model/fc1/w", "shape": [1024, 512]}, {"dtype": "float32", "name": "model/pi/b", "shape": [6]}, {"dtype": "float32", "name": "model/fc1/b", "shape": [512]}, {"dtype": "float32", "name": "ConstantFolding/input/truediv_recip", "shape": [10, 10, 5]}], "paths": ["group1-shard1of1.bin"]}], "convertedBy": "TensorFlow.js Converter v1.6.0", "modelTopology": {"versions": {"producer": 134}, "node": [{"attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "10"}, {"size": "10"}, {"size": "5"}]}}}, "name": "input/Ob", "op": "Placeholder"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}, "name": "model/c3/Reshape", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}, "name": "model/c2/Reshape", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}}, "name": "model/c1/Reshape", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "10"}, {"size": "5"}]}}}}, "name": "input/sub/y", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "5"}, {"size": "32"}]}}}}, "name": "model/c1/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "6"}]}}}}, "name": "model/pi/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}, "name": "model/c2/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}, "name": "model/c3/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "model/Reshape/shape", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}}, "name": "model/fc1/w", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}}, "name": "model/pi/b", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "model/fc1/b", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "10"}, {"size": "5"}]}}}}, "name": "ConstantFolding/input/truediv_recip", "op": "Const"}, {"input": ["input/Ob", "input/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "input/sub", "op": "Sub"}, {"input": ["ConstantFolding/input/truediv_recip", "input/sub"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "input/truediv", "op": "Mul"}, {"input": ["input/truediv", "model/c1/w"], "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "model/c1/Conv2D", "op": "Conv2D", "device": "/device:CPU:0"}, {"input": ["model/c1/Conv2D", "model/c1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/c1/add", "op": "AddV2"}, {"input": ["model/c1/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/Relu", "op": "Relu"}, {"input": ["model/Relu", "model/c2/w"], "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "model/c2/Conv2D", "op": "Conv2D", "device": "/device:CPU:0"}, {"input": ["model/c2/Conv2D", "model/c2/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/c2/add", "op": "AddV2"}, {"input": ["model/c2/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/Relu_1", "op": "Relu"}, {"input": ["model/Relu_1", "model/c3/w"], "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "model/c3/Conv2D", "op": "Conv2D", "device": "/device:CPU:0"}, {"input": ["model/c3/Conv2D", "model/c3/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/c3/add", "op": "AddV2"}, {"input": ["model/c3/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/Relu_2", "op": "Relu"}, {"input": ["model/Relu_2", "model/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "model/Reshape", "op": "Reshape"}, {"input": ["model/Reshape", "model/fc1/w"], "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}, "name": "model/fc1/MatMul", "op": "MatMul", "device": "/device:CPU:0"}, {"input": ["model/fc1/MatMul", "model/fc1/b"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/fc1/add", "op": "AddV2"}, {"input": ["model/fc1/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/Relu_3", "op": "Relu"}, {"input": ["model/Relu_3", "model/pi/w"], "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}, "name": "model/pi/MatMul", "op": "MatMul", "device": "/device:CPU:0"}, {"input": ["model/pi/MatMul", "model/pi/b"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/pi/add", "op": "AddV2"}, {"input": ["model/pi/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "output/Softmax", "op": "Softmax"}]}, "format": "graph-model", "userDefinedMetadata": {"signature": {"inputs": {"input/Ob:0": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}, {"size": "10"}, {"size": "5"}]}, "name": "input/Ob:0"}}, "outputs": {"output/Softmax:0": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}, "name": "output/Softmax:0"}}}}}