{"convertedBy": "TensorFlow.js Converter v1.6.0", "modelTopology": {"versions": {"producer": 134}, "node": [{"op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "10"}, {"size": "10"}, {"size": "5"}]}}, "dtype": {"type": "DT_FLOAT"}}, "name": "input/Ob"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/c3/Reshape"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/c2/Reshape"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/c1/Reshape"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "10"}, {"size": "10"}, {"size": "5"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "input/sub/y"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "5"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/c1/w"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "9"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/pi/w"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/c2/w"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/c3/w"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "model/Reshape/shape"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/fc1/w"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "9"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/pi/b"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/fc1/b"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "10"}, {"size": "10"}, {"size": "5"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "ConstantFolding/input/truediv_recip"}, {"op": "Sub", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "input/sub", "input": ["input/Ob", "input/sub/y"]}, {"op": "Mul", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "input/truediv", "input": ["ConstantFolding/input/truediv_recip", "input/sub"]}, {"attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}, "op": "Conv2D", "device": "/device:CPU:0", "name": "model/c1/Conv2D", "input": ["input/truediv", "model/c1/w"]}, {"op": "AddV2", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/c1/add", "input": ["model/c1/Conv2D", "model/c1/Reshape"]}, {"op": "Relu", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/Relu", "input": ["model/c1/add"]}, {"attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}, "op": "Conv2D", "device": "/device:CPU:0", "name": "model/c2/Conv2D", "input": ["model/Relu", "model/c2/w"]}, {"op": "AddV2", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/c2/add", "input": ["model/c2/Conv2D", "model/c2/Reshape"]}, {"op": "Relu", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/Relu_1", "input": ["model/c2/add"]}, {"attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}, "op": "Conv2D", "device": "/device:CPU:0", "name": "model/c3/Conv2D", "input": ["model/Relu_1", "model/c3/w"]}, {"op": "AddV2", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/c3/add", "input": ["model/c3/Conv2D", "model/c3/Reshape"]}, {"op": "Relu", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/Relu_2", "input": ["model/c3/add"]}, {"op": "Reshape", "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "model/Reshape", "input": ["model/Relu_2", "model/Reshape/shape"]}, {"attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "op": "MatMul", "device": "/device:CPU:0", "name": "model/fc1/MatMul", "input": ["model/Reshape", "model/fc1/w"]}, {"op": "AddV2", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/fc1/add", "input": ["model/fc1/MatMul", "model/fc1/b"]}, {"op": "Relu", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/Relu_3", "input": ["model/fc1/add"]}, {"attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "op": "MatMul", "device": "/device:CPU:0", "name": "model/pi/MatMul", "input": ["model/Relu_3", "model/pi/w"]}, {"op": "AddV2", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/pi/add", "input": ["model/pi/MatMul", "model/pi/b"]}, {"op": "Softmax", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "output/Softmax", "input": ["model/pi/add"]}]}, "format": "graph-model", "generatedBy": "1.15.0", "userDefinedMetadata": {"signature": {"outputs": {"output/Softmax:0": {"tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}, "name": "output/Softmax:0", "dtype": "DT_FLOAT"}}, "inputs": {"input/Ob:0": {"tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}, {"size": "10"}, {"size": "5"}]}, "name": "input/Ob:0", "dtype": "DT_FLOAT"}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "name": "model/c3/Reshape", "shape": [1, 1, 1, 64]}, {"dtype": "float32", "name": "model/c2/Reshape", "shape": [1, 1, 1, 64]}, {"dtype": "float32", "name": "model/c1/Reshape", "shape": [1, 1, 1, 32]}, {"dtype": "float32", "name": "input/sub/y", "shape": [10, 10, 5]}, {"dtype": "float32", "name": "model/c1/w", "shape": [3, 3, 5, 32]}, {"dtype": "float32", "name": "model/pi/w", "shape": [512, 9]}, {"dtype": "float32", "name": "model/c2/w", "shape": [3, 3, 32, 64]}, {"dtype": "float32", "name": "model/c3/w", "shape": [3, 3, 64, 64]}, {"dtype": "int32", "name": "model/Reshape/shape", "shape": [2]}, {"dtype": "float32", "name": "model/fc1/w", "shape": [1024, 512]}, {"dtype": "float32", "name": "model/pi/b", "shape": [9]}, {"dtype": "float32", "name": "model/fc1/b", "shape": [512]}, {"dtype": "float32", "name": "ConstantFolding/input/truediv_recip", "shape": [10, 10, 5]}]}]}