{"modelTopology": {"node": [{"op": "Placeholder", "name": "input/Ob", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "10"}, {"size": "10"}, {"size": "5"}]}}}}, {"op": "Const", "name": "model/c3/Reshape", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "model/c2/Reshape", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "model/c1/Reshape", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "input/sub/y", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "10"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "model/c1/w", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "5"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "model/pi/w", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "model/c2/w", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "model/c3/w", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "model/Reshape/shape", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "model/fc1/w", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "model/pi/b", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "model/fc1/b", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "ConstantFolding/input/truediv_recip", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "10"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Sub", "name": "input/sub", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["input/Ob", "input/sub/y"]}, {"op": "Mul", "name": "input/truediv", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["ConstantFolding/input/truediv_recip", "input/sub"]}, {"device": "/device:CPU:0", "op": "Conv2D", "name": "model/c1/Conv2D", "attr": {"use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["input/truediv", "model/c1/w"]}, {"op": "AddV2", "name": "model/c1/add", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["model/c1/Conv2D", "model/c1/Reshape"]}, {"op": "Relu", "name": "model/Relu", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["model/c1/add"]}, {"device": "/device:CPU:0", "op": "Conv2D", "name": "model/c2/Conv2D", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["model/Relu", "model/c2/w"]}, {"op": "AddV2", "name": "model/c2/add", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["model/c2/Conv2D", "model/c2/Reshape"]}, {"op": "Relu", "name": "model/Relu_1", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["model/c2/add"]}, {"device": "/device:CPU:0", "op": "Conv2D", "name": "model/c3/Conv2D", "attr": {"use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["model/Relu_1", "model/c3/w"]}, {"op": "AddV2", "name": "model/c3/add", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["model/c3/Conv2D", "model/c3/Reshape"]}, {"op": "Relu", "name": "model/Relu_2", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["model/c3/add"]}, {"op": "Reshape", "name": "model/Reshape", "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "input": ["model/Relu_2", "model/Reshape/shape"]}, {"device": "/device:CPU:0", "op": "MatMul", "name": "model/fc1/MatMul", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}, "input": ["model/Reshape", "model/fc1/w"]}, {"op": "AddV2", "name": "model/fc1/add", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["model/fc1/MatMul", "model/fc1/b"]}, {"op": "Relu", "name": "model/Relu_3", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["model/fc1/add"]}, {"device": "/device:CPU:0", "op": "MatMul", "name": "model/pi/MatMul", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}, "input": ["model/Relu_3", "model/pi/w"]}, {"op": "AddV2", "name": "model/pi/add", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["model/pi/MatMul", "model/pi/b"]}, {"op": "Softmax", "name": "output/Softmax", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["model/pi/add"]}], "versions": {"producer": 134}}, "weightsManifest": [{"weights": [{"dtype": "float32", "name": "model/c3/Reshape", "shape": [1, 1, 1, 64]}, {"dtype": "float32", "name": "model/c2/Reshape", "shape": [1, 1, 1, 64]}, {"dtype": "float32", "name": "model/c1/Reshape", "shape": [1, 1, 1, 32]}, {"dtype": "float32", "name": "input/sub/y", "shape": [10, 10, 5]}, {"dtype": "float32", "name": "model/c1/w", "shape": [3, 3, 5, 32]}, {"dtype": "float32", "name": "model/pi/w", "shape": [512, 9]}, {"dtype": "float32", "name": "model/c2/w", "shape": [3, 3, 32, 64]}, {"dtype": "float32", "name": "model/c3/w", "shape": [3, 3, 64, 64]}, {"dtype": "int32", "name": "model/Reshape/shape", "shape": [2]}, {"dtype": "float32", "name": "model/fc1/w", "shape": [1024, 512]}, {"dtype": "float32", "name": "model/pi/b", "shape": [9]}, {"dtype": "float32", "name": "model/fc1/b", "shape": [512]}, {"dtype": "float32", "name": "ConstantFolding/input/truediv_recip", "shape": [10, 10, 5]}], "paths": ["group1-shard1of1.bin"]}], "convertedBy": "TensorFlow.js Converter v1.6.0", "format": "graph-model", "userDefinedMetadata": {"signature": {"inputs": {"input/Ob:0": {"dtype": "DT_FLOAT", "name": "input/Ob:0", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}, {"size": "10"}, {"size": "5"}]}}}, "outputs": {"output/Softmax:0": {"dtype": "DT_FLOAT", "name": "output/Softmax:0", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}}}}}, "generatedBy": "1.15.0"}