{"modelTopology": {"versions": {"producer": 134}, "node": [{"attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "10"}, {"size": "10"}, {"size": "5"}]}}, "dtype": {"type": "DT_FLOAT"}}, "name": "input/Ob", "op": "Placeholder"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/c3/Reshape", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/c2/Reshape", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/c1/Reshape", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "10"}, {"size": "10"}, {"size": "5"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "input/sub/y", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "5"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/c1/w", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "6"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/pi/w", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/c2/w", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/c3/w", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "model/Reshape/shape", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/fc1/w", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "6"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/pi/b", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "model/fc1/b", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "10"}, {"size": "10"}, {"size": "5"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "ConstantFolding/input/truediv_recip", "op": "Const"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "name": "input/sub", "input": ["input/Ob", "input/sub/y"], "op": "Sub"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "name": "input/truediv", "input": ["ConstantFolding/input/truediv_recip", "input/sub"], "op": "Mul"}, {"attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "model/c1/Conv2D", "device": "/device:CPU:0", "input": ["input/truediv", "model/c1/w"], "op": "Conv2D"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/c1/add", "input": ["model/c1/Conv2D", "model/c1/Reshape"], "op": "AddV2"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/Relu", "input": ["model/c1/add"], "op": "Relu"}, {"attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "model/c2/Conv2D", "device": "/device:CPU:0", "input": ["model/Relu", "model/c2/w"], "op": "Conv2D"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/c2/add", "input": ["model/c2/Conv2D", "model/c2/Reshape"], "op": "AddV2"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/Relu_1", "input": ["model/c2/add"], "op": "Relu"}, {"attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "model/c3/Conv2D", "device": "/device:CPU:0", "input": ["model/Relu_1", "model/c3/w"], "op": "Conv2D"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/c3/add", "input": ["model/c3/Conv2D", "model/c3/Reshape"], "op": "AddV2"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/Relu_2", "input": ["model/c3/add"], "op": "Relu"}, {"attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "model/Reshape", "input": ["model/Relu_2", "model/Reshape/shape"], "op": "Reshape"}, {"attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}, "name": "model/fc1/MatMul", "device": "/device:CPU:0", "input": ["model/Reshape", "model/fc1/w"], "op": "MatMul"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/fc1/add", "input": ["model/fc1/MatMul", "model/fc1/b"], "op": "AddV2"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/Relu_3", "input": ["model/fc1/add"], "op": "Relu"}, {"attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}, "name": "model/pi/MatMul", "device": "/device:CPU:0", "input": ["model/Relu_3", "model/pi/w"], "op": "MatMul"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "name": "model/pi/add", "input": ["model/pi/MatMul", "model/pi/b"], "op": "AddV2"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "name": "output/Softmax", "input": ["model/pi/add"], "op": "Softmax"}]}, "weightsManifest": [{"weights": [{"shape": [1, 1, 1, 64], "name": "model/c3/Reshape", "dtype": "float32"}, {"shape": [1, 1, 1, 64], "name": "model/c2/Reshape", "dtype": "float32"}, {"shape": [1, 1, 1, 32], "name": "model/c1/Reshape", "dtype": "float32"}, {"shape": [10, 10, 5], "name": "input/sub/y", "dtype": "float32"}, {"shape": [3, 3, 5, 32], "name": "model/c1/w", "dtype": "float32"}, {"shape": [512, 6], "name": "model/pi/w", "dtype": "float32"}, {"shape": [3, 3, 32, 64], "name": "model/c2/w", "dtype": "float32"}, {"shape": [3, 3, 64, 64], "name": "model/c3/w", "dtype": "float32"}, {"shape": [2], "name": "model/Reshape/shape", "dtype": "int32"}, {"shape": [1024, 512], "name": "model/fc1/w", "dtype": "float32"}, {"shape": [6], "name": "model/pi/b", "dtype": "float32"}, {"shape": [512], "name": "model/fc1/b", "dtype": "float32"}, {"shape": [10, 10, 5], "name": "ConstantFolding/input/truediv_recip", "dtype": "float32"}], "paths": ["group1-shard1of1.bin"]}], "generatedBy": "1.15.0", "convertedBy": "TensorFlow.js Converter v1.6.0", "userDefinedMetadata": {"signature": {"inputs": {"input/Ob:0": {"name": "input/Ob:0", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}, {"size": "10"}, {"size": "5"}]}, "dtype": "DT_FLOAT"}}, "outputs": {"output/Softmax:0": {"name": "output/Softmax:0", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}, "dtype": "DT_FLOAT"}}}}, "format": "graph-model"}